; domain
(define (domain hamiltonian-cycle)
  (:requirements :strips :typing :equality :negative-preconditions)
  (:types vertex count)
  (:predicates
    (connected ?v1 ?v2 - vertex)       ; there is an edge between v1 and v2
    (visited ?v - vertex)              ; vertex v has been visited
    (current ?v - vertex)              ; current position in the path
    (start ?v - vertex)                ; starting vertex
    (path-length ?n - count)          ; number of vertices visited so far
    (next ?n1 ?n2 - count)            ; successor relation for counts
    (total-vertices ?n - count)       ; total number of vertices in the graph
  )
  
  (:action select-start
    :parameters (?v - vertex ?zero ?one - count)
    :precondition (and 
      (not (exists (?any - vertex) (start ?any)))  ; no start vertex selected yet
      (path-length ?zero)                          ; path length is zero
      (next ?zero ?one)                            ; one is the successor of zero
    )
    :effect (and
      (start ?v)                                   ; mark as start vertex
      (current ?v)                                 ; set as current position
      (visited ?v)                                 ; mark as visited
      (not (path-length ?zero))                    ; update path length
      (path-length ?one)                           ; path length is now one
    )
  )
  
  (:action move-to-next
    :parameters (?from ?to - vertex ?n1 ?n2 - count)
    :precondition (and
      (current ?from)                 ; we are at vertex "from"
      (connected ?from ?to)           ; there is an edge from "from" to "to"
      (not (visited ?to))             ; "to" hasn't been visited yet
      (path-length ?n1)               ; current path length
      (next ?n1 ?n2)                  ; n2 is successor of n1
    )
    :effect (and
      (not (current ?from))           ; no longer at "from"
      (current ?to)                   ; now at "to"
      (visited ?to)                   ; mark "to" as visited
      (not (path-length ?n1))         ; update path length
      (path-length ?n2)               ; increment path length
    )
  )
  
  (:action complete-cycle
    :parameters (?last ?first - vertex ?n - count)
    :precondition (and
      (current ?last)                 ; we are at vertex "last"
      (start ?first)                  ; "first" is the start vertex
      (connected ?last ?first)        ; there is an edge from "last" to "first"
      (path-length ?n)                ; current path length
      (total-vertices ?n)             ; all vertices have been visited
    )
    :effect (and
      (not (current ?last))           ; no longer at "last"
      (current ?first)                ; back at "first"
    )
  )
)

; problem
(define (problem hamiltonian-example)
  (:domain hamiltonian-cycle)
  
  (:objects
    v1 v2 v3 v4 v5 v6 v7 v8 v9 v10 v11 v12 - vertex
    n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 - count
  )
  
  (:init
    ; Define the graph structure (edges)
        (connected v1 v6)
    (connected v6 v1)
    (connected v1 v9)
    (connected v9 v1)
    (connected v1 v11)
    (connected v11 v1)
    (connected v2 v3)
    (connected v3 v2)
    (connected v2 v4)
    (connected v4 v2)
    (connected v2 v5)
    (connected v5 v2)
    (connected v2 v8)
    (connected v8 v2)
    (connected v2 v11)
    (connected v11 v2)
    (connected v3 v4)
    (connected v4 v3)
    (connected v3 v5)
    (connected v5 v3)
    (connected v3 v7)
    (connected v7 v3)
    (connected v3 v10)
    (connected v10 v3)
    (connected v3 v11)
    (connected v11 v3)
    (connected v4 v7)
    (connected v7 v4)
    (connected v4 v8)
    (connected v8 v4)
    (connected v4 v10)
    (connected v10 v4)
    (connected v5 v7)
    (connected v7 v5)
    (connected v5 v10)
    (connected v10 v5)
    (connected v6 v7)
    (connected v7 v6)
    (connected v6 v10)
    (connected v10 v6)
    (connected v6 v11)
    (connected v11 v6)
    (connected v6 v12)
    (connected v12 v6)
    (connected v7 v10)
    (connected v10 v7)
    (connected v7 v11)
    (connected v11 v7)
    (connected v8 v9)
    (connected v9 v8)
    (connected v8 v12)
    (connected v12 v8)
    (connected v9 v10)
    (connected v10 v9)
    (connected v9 v11)
    (connected v11 v9)
    (connected v10 v11)
    (connected v11 v10)
    (connected v10 v12)
    (connected v12 v10)
    (connected v11 v12)
    (connected v12 v11)
    
    ; Define the count sequence for tracking path length
        (next n0 n1)
    (next n1 n2)
    (next n2 n3)
    (next n3 n4)
    (next n4 n5)
    (next n5 n6)
    (next n6 n7)
    (next n7 n8)
    (next n8 n9)
    (next n9 n10)
    (next n10 n11)
    (next n11 n12)
    
    ; Initial path length is zero
    (path-length n0)
    
    ; Total number of vertices
    (total-vertices n12)
  )
  
  (:goal
    (and
      ; We've returned to the start vertex
      (exists (?v - vertex) 
        (and (start ?v) (current ?v)))
      
      ; All vertices have been visited
      (visited v1)
      (visited v2)
      (visited v3)
      (visited v4)
      (visited v5)
      (visited v6)
      (visited v7)
      (visited v8)
      (visited v9)
      (visited v10)
      (visited v11)
      (visited v12)
      
      ; Path length equals total vertices
      (path-length n12)
    )
  )
)

; plan
1. (select-start v12 n0 n1)
   deleted: (path-length n0)
   added: (start v12) (current v12) (visited v12) (path-length n1)
   goals met: 2 of 14
2. (move-to-next v12 v6 n1 n2)
   deleted: (current v12) (path-length n1)
   added: (current v6) (visited v6) (path-length n2)
   goals met: 2 of 14
3. (move-to-next v6 v1 n2 n3)
   deleted: (current v6) (path-length n2)
   added: (current v1) (visited v1) (path-length n3)
   goals met: 3 of 14
4. (move-to-next v1 v9 n3 n4)
   deleted: (current v1) (path-length n3)
   added: (current v9) (visited v9) (path-length n4)
   goals met: 4 of 14
5. (move-to-next v9 v8 n4 n5)
   deleted: (current v9) (path-length n4)
   added: (current v8) (visited v8) (path-length n5)
   goals met: 5 of 14
6. (move-to-next v8 v2 n5 n6)
   deleted: (current v8) (path-length n5)
   added: (current v2) (visited v2) (path-length n6)
   goals met: 6 of 14
7. (move-to-next v2 v3 n6 n7)
   deleted: (current v2) (path-length n6)
   added: (current v3) (visited v3) (path-length n7)
   goals met: 7 of 14
8. (move-to-next v3 v4 n7 n8)
   deleted: (current v3) (path-length n7)
   added: (current v4) (visited v4) (path-length n8)
   goals met: 8 of 14
9. (move-to-next v4 v7 n8 n9)
   deleted: (current v4) (path-length n8)
   added: (current v7) (visited v7) (path-length n9)
   goals met: 9 of 14
10. (move-to-next v7 v5 n9 n10)
   deleted: (current v7) (path-length n9)
   added: (current v5) (visited v5) (path-length n10)
   goals met: 10 of 14
11. (move-to-next v5 v10 n10 n11)
   deleted: (current v5) (path-length n10)
   added: (current v10) (visited v10) (path-length n11)
   goals met: 11 of 14
12. (move-to-next v10 v11 n11 n12)
   deleted: (current v10) (path-length n11)
   added: (current v11) (visited v11) (path-length n12)
   goals met: 13 of 14
13. (complete-cycle v11 v12 n12)
   deleted: (current v11)
   added: (current v12)
   goals met: 14 of 14
